# Transform Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveLoop..::..Transform Method
CurveLoop Class See Also
---
Transforms this curve loop and all of its component curves by the supplied transformation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void Transform(
	Transform transform
)
```

Visual Basic
---
```text
Public Sub Transform ( _
	transform As Transform _
)
```

Visual C++
---
```text
public:
void Transform(
	Transform^ transform
)
```

# ### Parameters
transform
    Type: Autodesk.Revit.DB..::..Transform The transformation.
# Remarks
The modified CurveLoop is guaranteed to be valid with all consituent curves contiguous (assuming that the curves were contiguous in the input curve loop).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | transform is not conformal. -or- transform has a scale that is negative or zero. |

# See Also
CurveLoop Class
Autodesk.Revit.DB Namespace